#ifndef DATAGENERATOR_HPP
#define DATAGENERATOR_HPP

#include "SDK/datahelper.hpp"
#include "Job/inspectiondata.hpp"

namespace App
{
    /**
     *  @brief    DataGenerator
     *            数据生成器
     *  @author   plato
     *  @version  1.00 2017-11-29 plato
     *                 note:create it
     */
    class DataGenerator
    {
    public:
        //>>>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
        //constructor & destructor

        /*
        *  @brief   DataGenerator:  构造函数
        *  @param   N/A
        *  @return  N/A
        */
        DataGenerator();

        /*
        *  @brief   ~DataGenerator: 析构函数
        *  @param   N/A
        *  @return  N/A
        */
        ~DataGenerator();

        //<<<----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------


        //>>>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
        //member functions

        /*
        *  @brief   generateData:  生成数据
        *  @param   N/A
        *  @return  N/A
        */
        void generateData();

        //<<<----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------



    };

}//End of namespace App

#endif // DATAGENERATOR_HPP
